{"format": "layers-model", "generatedBy": "keras v2.9.0", "convertedBy": "TensorFlow.js Converter v3.19.0", "modelTopology": {"keras_version": "2.9.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_23", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100, 30], "dtype": "float32", "sparse": false, "ragged": false, "name": "lstm_46_input"}}, {"class_name": "LSTM", "config": {"name": "lstm_46", "trainable": true, "batch_input_shape": [null, 100, 30], "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 1024, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "LSTM", "config": {"name": "lstm_47", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 512, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, {"class_name": "Reshape", "config": {"name": "reshape_44", "trainable": true, "dtype": "float32", "target_shape": [100, 512, 1]}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_22", "trainable": true, "dtype": "float32", "layer": {"class_name": "GlobalAveragePooling1D", "config": {"name": "global_average_pooling1d_22", "trainable": true, "dtype": "float32", "data_format": "channels_last", "keepdims": false}}}}, {"class_name": "Reshape", "config": {"name": "reshape_45", "trainable": true, "dtype": "float32", "target_shape": [100]}}, {"class_name": "Dense", "config": {"name": "dense_88", "trainable": true, "dtype": "float32", "units": 128, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_89", "trainable": true, "dtype": "float32", "units": 64, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_90", "trainable": true, "dtype": "float32", "units": 32, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_18", "trainable": true, "dtype": "float32", "rate": 0.002, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"name": "dense_91", "trainable": true, "dtype": "float32", "units": 7, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "categorical_accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}, {"class_name": "MeanMetricWrapper", "config": {"name": "f1_m", "dtype": "float32", "fn": "f1_m"}}, {"class_name": "MeanMetricWrapper", "config": {"name": "precision_m", "dtype": "float32", "fn": "precision_m"}}, {"class_name": "MeanMetricWrapper", "config": {"name": "recall_m", "dtype": "float32", "fn": "recall_m"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of8.bin", "group1-shard2of8.bin", "group1-shard3of8.bin", "group1-shard4of8.bin", "group1-shard5of8.bin", "group1-shard6of8.bin", "group1-shard7of8.bin", "group1-shard8of8.bin"], "weights": [{"name": "dense_88/kernel", "shape": [100, 128], "dtype": "float32"}, {"name": "dense_88/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_89/kernel", "shape": [128, 64], "dtype": "float32"}, {"name": "dense_89/bias", "shape": [64], "dtype": "float32"}, {"name": "dense_90/kernel", "shape": [64, 32], "dtype": "float32"}, {"name": "dense_90/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_91/kernel", "shape": [32, 7], "dtype": "float32"}, {"name": "dense_91/bias", "shape": [7], "dtype": "float32"}, {"name": "lstm_46/lstm_cell_46/kernel", "shape": [30, 4096], "dtype": "float32"}, {"name": "lstm_46/lstm_cell_46/recurrent_kernel", "shape": [1024, 4096], "dtype": "float32"}, {"name": "lstm_46/lstm_cell_46/bias", "shape": [4096], "dtype": "float32"}, {"name": "lstm_47/lstm_cell_47/kernel", "shape": [1024, 2048], "dtype": "float32"}, {"name": "lstm_47/lstm_cell_47/recurrent_kernel", "shape": [512, 2048], "dtype": "float32"}, {"name": "lstm_47/lstm_cell_47/bias", "shape": [2048], "dtype": "float32"}]}]}